{
  "id": "3419169012426740939",
  "url": "https://www.instagram.com/p/C9zVBnsuBTL/",
  "datePosted": "2024-07-24T10:26:34.000Z",
  "shortCode": "C9zVBnsuBTL",
  "timestamp": "2024-07-24T10:26:34.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fgyn8-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQOoR8lcjnsCXIJ1b-1FB3CnKRzhnVSh9vTBDhVXC-MxYOY1MgtCA7-NKW-ul9B4HADeUz7oXuzrD51zdJ-cqxEpnvXjNqIi6XsDoq8.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=103&vs=1021601236214046_1524808779&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC82ODQ1MTUyNUIzM0JBQ0RFODJBNTNDRDZGQ0Y2NkI4NF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dCSW0tUnJpdV8xbGFBUURBRUZOLWx0N0ZlZ05icV9FQUFBRhUCAsgBACgAGAAbABUAACbw4J6I3ZmFQRUCKAJDMywXQFTu6XjU%2FfQYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=2c42c13193&ccb=9-4&oh=00_AYH9avT1sN0ECYbR6ag5sJOjIqUrcbmPRK9dbt6sZtO1Eg&oe=67D166B1&_nc_sid=10d13b",
  "videoPlayCount": 2027635,
  "videoViewCount": 758343,
  "hashtags": [
    "paycheck",
    "budget",
    "budgeting",
    "money",
    "wealth",
    "financialadvisor",
    "socialcap"
  ],
  "slug": "automate-your-paycheck",
  "title": "Automate Your Paycheck: Four Essential Steps to Secure Your Financial Future",
  "subtitle": "Discover four critical strategies to automate your paycheck for financial security and retirement success, including investment tips and emergency fund strategies.",
  "content": "<p>Before that paycheck even hits your bank account, you need to automate the following four things. I'm Tyler, I'm a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p> <h2>1. Contribute to Retirement Accounts</h2> <p><strong>8% of that paycheck needs to go directly into a 401k or a Roth IRA if you're a man.</strong> I would encourage 13% to go into those accounts if you're a woman. Women spend on average 11 and a half months away from the workforce compared to 16 months for men. They also live on average seven years longer and they currently have on average 34% less in their retirement accounts.</p> <h2>2. Build an Emergency Fund</h2> <p><strong>2% of that paycheck needs to go directly to an emergency fund,</strong> either in a high yield savings account or invested in a money market fund. Both of these options are currently returning around 4.5% and allow your money to work for you, not somebody else.</p> <h2>3. Invest in a Brokerage Account</h2> <p><strong>2% of that paycheck needs to go directly into a brokerage account</strong> and invested in a low cost index fund like Fidelity's FX AIX. This serves as your other emergency fund as you can sell these investments anytime penalty free. Additionally, as long as you hold these investments for over one year, you'll be taxed at about 50% of what you'd be taxed on ordinary income.</p> <h2>4. Contribute to a Health Savings Account</h2> <p><strong>2% of that paycheck needs to go directly to a health savings account</strong> if you have access to one through your company or you have a high deductible health plan. Contributions to this account are tax deductible, investments grow tax free, and you can spend that money on almost anything health related for you and your family without ever having to pay taxes on withdrawal.</p> <p>If any of this is helpful, <strong>like and follow</strong> and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Planning",
    "Retirement Savings",
    "Emergency Fund",
    "Investment Strategies",
    "Health Savings Account"
  ]
}