{
  "id": "3369936696689497464",
  "url": "https://www.instagram.com/p/C7Ea5IpuxV4/",
  "datePosted": "2024-05-17T12:10:49.000Z",
  "shortCode": "C7Ea5IpuxV4",
  "timestamp": "2024-05-17T12:10:49.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fadd1-1.fna.fbcdn.net/o1/v/t16/f2/m82/AQOr_LoqMR3YPY7yCmW_n3wVWZ0gOEYN2dOeGjVxri0-2kGxQf1b9fa3T-7p_eQQzgfT_vlE9cgyfPoSiaHmBbp9b2eauTvvatY-WVE.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=100&vs=350524980989583_2456909891&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC9GNzQyQ0M2NDI2MDk5NkI3MjJEOUMxODIxNzg3QjE5OF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dQZ0QtaGxQYk9yX3N1RU1BSC1qRkJYanV0QXNicV9FQUFBRhUCAsgBACgAGAAbABUAACbAyc%2F%2Bg8fwPxUCKAJDMywXQFHTMzMzMzMYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=a4c8e3cc2b&ccb=9-4&oh=00_AYHNkapvzI_No7NFLKlQ4_RLEM7J3Wummi__29mtLcgldw&oe=67D14BAA&_nc_sid=10d13b",
  "videoPlayCount": 382028,
  "videoViewCount": 12127,
  "hashtags": [
    "collegedegree",
    "collegetuition",
    "studenloandebt",
    "debt",
    "tuition",
    "financialliteracy",
    "personalfinance",
    "college",
    "financialfreedom",
    "vocationalschool",
    "votech"
  ],
  "slug": "college-vs-votech-career-paths",
  "title": "College vs. Vo-Tech: The Two Paths to Career Success Explored",
  "subtitle": "This discussion delves into the contrasting career trajectories of college graduates and vocational school attendees, highlighting real-life experiences, financial implications, and job stability in today's economy.",
  "content": "<h1>College vs. Vo-Tech: A Journey of Two Careers</h1>\n<p>I'll bet I make way more money as a college graduate than you do as someone who chose not to go to college. Maybe let's see how this one plays out post-college.</p>\n\n<h2>The Beginning of Our Careers</h2>\n<p>I just got my first job offer with a degree in English literature. I'll be teaching seventh grade writing and making thirty thousand a year. Just have to start paying back a hundred thousand of student loans at five percent interest. Oh yikes!</p>\n\n<p>I got a job at my local garage when I was 18 because I did votech in high school. I've been making the same thirty thousand dollars a year while you've been paying back interest at five percent.</p>\n\n<h2>Growth Over Time</h2>\n<p>I've been investing some of the money and earning interest at five percent. Five years later, I just got promoted to senior teacher and I'm currently making fifty thousand dollars a year. You know, still paying down that debt at five percent, but I'm about a quarter of the way there.</p>\n\n<p>I'm starting to put in some good hours, and I made about sixty thousand dollars last year. How many people in my area have 13 years experience working on engines? I'm just glad I started learning a practical skill super early in life.</p>\n\n<h2>Challenges Ahead</h2>\n<p>Fifteen years later, I just got laid off because of demographic shifts in my area—fewer kids coming to school. I don’t know what I'm going to do with my English degree. Maybe write a memoir.</p>\n\n<p>Sorry to hear that; I run my own shop now and make about a hundred thousand a year. Even in a recession, we still have to fix cars. I could start teaching you how to do some of this work, but I'm a college graduate. It wasn't supposed to be like this.</p>",
  "tags": [
    "Career Choices",
    "Vocational Education",
    "College Graduate",
    "Financial Implications",
    "Job Security"
  ]
}