{
  "id": "3386639059353421145",
  "url": "https://www.instagram.com/p/C7_wkgDOUVZ/",
  "datePosted": "2024-06-09T13:16:21.000Z",
  "shortCode": "C7_wkgDOUVZ",
  "timestamp": "2024-06-09T13:16:21.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fcgh11-1.fna.fbcdn.net/o1/v/t16/f2/m82/AQOwAq_dyyUwiiC1p5RxG0UmL0qVtFvVachzFA4wdUJCEe6uy-i64eDMvaYs2bxlZlMk50L47ZfaytoIxZYFTdE08pdy5z6pjI6XACQ.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=105&vs=7570889143018625_884283122&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC9ENDREMUIyMDgyOUMyMkRCMUMxMEQzQUE2NjM0RTg5MV92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dIY1h0QnFBTEFoU3g4b0NBTE9jRnRkN3FRWklicV9FQUFBRhUCAsgBACgAGAAbABUAACbkjbbCj6SJQBUCKAJDMywXQF2CHKwIMScYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=944e6e9a52&ccb=9-4&oh=00_AYEUJPRZyN_iVChqp1vGLtt7GXBMJgWtmog_kasroZIugw&oe=67D15EEF&_nc_sid=10d13b",
  "videoPlayCount": 9177,
  "videoViewCount": 2178,
  "hashtags": [
    "money.",
    "financialadvisor",
    "investing",
    "retireearly",
    "retire",
    "wealth",
    "socialcap"
  ],
  "slug": "financial-advisor-warning-signs",
  "title": "Important Warning Signs to Look for When Choosing a Financial Advisor",
  "subtitle": "Discover crucial insights to ensure you're making informed decisions when selecting a financial advisor. Protect your investments by recognizing the key warning signs to watch out for in potential financial advisors.",
  "content": "<h2>If You Are Looking to Work with a Financial Advisor</h2> <p>Here are five more things you should be aware of.</p> <p>I'm Tyler. I'm a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p> <h3>1. They Guarantee You a Future Return on Your Money</h3> <p>Even the United States government does not guarantee you a return on their bonds because they know things can and will go wrong—even to the most established and powerful institutions in the world. So if there is any form of guarantee on the table, run for the hills.</p> <h3>2. The Advisor or Broker Has a Record of Unethical or Illegal Behavior</h3> <p>You'd think this one would be obvious, but you might be shocked to learn how few people actually check on their broker, dealer, or advisor's regulatory history. So go to FINRA's Broker Check or the SEC's Investment Advisor Public Disclosure website, and no news is good news.</p> <h3>3. They Claim They Will Beat the Market in the Future</h3> <p>Because they have done so in the past. There is a reason that the Securities and Exchange Commission, which regulates the majority of the financial industry, requires all advisors and broker-dealers to put, and I quote, past performance is not indicative of future results on all of their marketing material. A monkey throwing darts could beat the market in any given year—it is never an indication that they will continue to do so in the future.</p> <h3>4. They Put You in a Fund of Funds</h3> <p>You heard me, a fund of funds. So now you pay your advisor 1% to put you in a fund that charges 1% to put you in five more funds that charge 1%. And you know who's paying all those 1%s? Not the advisor.</p> <h3>5. They Do Not Act as a Fiduciary</h3> <p>Look, all fiduciaries are not created equal, but they are still required by law to act in your best interest, whereas broker-dealers, banks, and insurance companies typically only have to adhere to the far less stringent suitability standard. In other words, they may be considering other things when making investment recommendations for you, like how much money they're going to make off the product that they sell you.</p> <p>And if any of this is helpful, like and follow, and I'll continue to try to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advisors",
    "Investment Tips",
    "Fiduciary Duty",
    "Market Performance",
    "Broker Recommendations"
  ]
}