{
  "id": "3378884097349431282",
  "url": "https://www.instagram.com/p/C7kNS83uq_y/",
  "datePosted": "2024-05-29T20:28:43.000Z",
  "shortCode": "C7kNS83uq_y",
  "timestamp": "2024-05-29T20:28:43.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-lga3-2.cdninstagram.com/o1/v/t16/f2/m82/AQMlZXzRrU9qqN4rfnzFkBpflXXhjPfqdQN4w46StBNdB9Yes-EyvH-wXcsKv129sTguDQE_PdKoMBUvi6tABQ-BIt_F2lF7HKgkZXU.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=107&vs=2682053301962679_1078325956&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC8xMzQ3Q0U1MjM4MTRDRkVEQ0ZGMDk2Q0M3OEMyODc4OF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dIRzFrUnFIZTFuT1gxNERBT3VJSmFBN0V6QVVicV9FQUFBRhUCAsgBACgAGAAbABUAACaugaD8%2B7%2BRQBUCKAJDMywXQGUkQYk3S8cYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=9dbca5b9e0&ccb=9-4&oh=00_AYH2y-l6ITox0QfsB0GyDeM6LFYcmRxgTmhRg37E2CtyrQ&oe=67D17C59&_nc_sid=10d13b",
  "videoPlayCount": 158610,
  "videoViewCount": 4549,
  "hashtags": [
    "financialadvisor",
    "finance",
    "money",
    "socialcap",
    "banks"
  ],
  "slug": "financial-freedom-through-education",
  "title": "Achieving Financial Freedom Through Education: My Journey from Teaching to Advising",
  "subtitle": "Discover how one English teacher’s journey into finance led to a passion for financial education and empowerment, ultimately emphasizing the importance of financial literacy for sustainable economic freedom.",
  "content": "<h1>Achieving Financial Freedom Through Education: My Journey from Teaching to Advising</h1>\n<p>I’m certainly not gonna make any friends in finance for telling you this story, but it happened. It’s ridiculous; I swear it will make you, well, I’ll let you be the judge of that.</p>\n\n<p>But first I’ll tell you really quickly just why I wanted to get into finance in the first place. See, my first real job out of college was as an English teacher. I was an English major; I didn’t exactly have any options as you all know when you finally get your first big kid job. You got to start thinking about big kid things: 401ks, IRAs, 403 Bs, taxes, and like many of you, I knew absolutely nothing because I had never learned any of this in school.</p>\n\n<p>To invest how to invest, what the word invest even means, I did what any good English teacher would do when faced with a real challenge: I sat alone in my apartment and I read a book. That first book blew my mind; I had never known any of this. And I thought, this is it, I’m gonna be a millionaire! I opened up a brokerage account, funded it with 50 bucks, and invested it in a penny stock because my friend told me to. I lost it all. But I didn’t quit. Even though I probably should have, I kept learning, kept reading, and eventually started teaching my colleagues about personal finance. I loved it absolutely loved it.</p>\n\n<p>Then I remembered: hey, isn’t there a job where I actually could do this for a living? Yeah, I could become a financial advisor! Then I could get paid to teach people about finance. Cool, I’m in, sign me up!</p>\n\n<p>There was only one problem. I didn’t have any qualifications or licenses or experience. Turns out, not a problem. Big banks do not care. I called three of the world’s biggest banks and got three interviews within a week.</p>\n\n<p>For my first interview, at let’s just call it Beryl Finch—no, I don’t want to implicate anybody—I got to meet with the vice president. Turns out they’re all vice presidents. I put on my black suit, felt like a ding-dong, holding the VP all about how much passion I had for helping people learn about personal finance. But I also told him I was scared, you know, because I didn’t have any experience; I didn’t think I was smart enough.</p>\n\n<p>And you know what he said? I’m not kidding. He turned to me and said, “Tyler, you need a lot of things to be good at this job. Being smart definitely is not one of them.” Huh? I’m sorry, I said, “I don’t need to be smart to help people manage their financial livelihood?” You know, as the financial expert?</p>\n\n<p>Exactly, he said. “This job is about finding what products people need and selling them those products.” He said, “In fact,” he whispered, “we don’t even manage people’s money anymore. You let another firm do that!” What?</p>\n\n<p>So, what would you say you do? I asked. “Our number one job is to bring people through that door and convince them to let us manage their money,” he said with a fine smirk on his face. But you just said you didn’t even manage their money!</p>\n\n<p>Exactly, he cut me off.</p>\n\n<p>That’s when he asked to see the only document that apparently mattered to him—not my resume, certainly not my personal statement list that they had asked me to create of all the people that I knew, all my personal network, anyone with over a million dollars.</p>\n\n<p>Well, here’s how it ends. I left the interview, and a few days later, they called me, “Tyler,” he began, “Honestly, I don’t think you’re cut out for this job.” I wasn’t surprised; you seem to be more interested in educating people.</p>\n\n<p>Well, turns out they were right, and thankfully, I didn’t spend years of my life selling used car—I mean, financial products! And here’s your takeaway: today’s financial literacy is truly tomorrow’s financial freedom. Keep learning and keep climbing.</p>",
  "tags": [
    "Financial Literacy",
    "Financial Education",
    "Personal Finance",
    "Investment Journeys",
    "Career Changes"
  ]
}