{
  "id": "3383990202956953622",
  "url": "https://www.instagram.com/p/C72WSkSprgW/",
  "datePosted": "2024-06-05T21:32:55.000Z",
  "shortCode": "C72WSkSprgW",
  "timestamp": "2024-06-05T21:32:55.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-jnb2-1.cdninstagram.com/o1/v/t16/f2/m82/AQP3gR-gH5cCfRFxuwtMxVUR6MMDBAteIxZHWbGvExPB3LbUVVpOB9Zp5imBMYGMc-yxAjEWs3lTAB4Kg_nbilkvX49Hn21FjJvcJ2c.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=100&vs=449435084482513_2982754654&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC82NzQ4NUM0MzZGOTRCOUM0RENDQURFQzEyMTRCQjNBOV92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dOVkdzaHI2SjBiZGlETUZBQnlzRThBcVlScGVicV9FQUFBRhUCAsgBACgAGAAbABUAACbWm4%2Bf3aWJQBUCKAJDMywXQGJlT987ZFoYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=8561a4fbf3&ccb=9-4&oh=00_AYFdUXWXGK_CT7BoCpCHhFlQeyc69D9ttTGF4raNg_L9Vg&oe=67D16FE7&_nc_sid=10d13b",
  "videoPlayCount": 1590165,
  "videoViewCount": 293311,
  "hashtags": [
    "finance",
    "bankaccount",
    "checkingaccount",
    "rothira",
    "401(k)",
    "hsa",
    "brokerageaccount",
    "highyieldsavingsaccount."
  ],
  "slug": "five-essential-financial-accounts",
  "title": "The 5 Financial Accounts You Need for a Secure Future",
  "subtitle": "Discover the essential financial accounts that will serve you for a lifetime and help you achieve your financial goals.",
  "content": "<h1>The 5 Financial Accounts You Need for a Secure Future</h1>\n<p>Here are the only 5 financial accounts that you will ever need for the rest of your life. You might want to save this video because this advice is as true today as it will be in <strong>30 years</strong>.</p>\n\n<h2>1. Checking Account</h2>\n<p>Your first account is a <strong>checking account</strong>. This account should only be used to keep money to pay your monthly bills. Any other money in this account is wasted because, in a checking account, your money does not work for you and earns almost <strong>0%</strong> interest.</p>\n\n<h2>2. High Yield Savings Account</h2>\n<p>Your second account is a <strong>high yield savings account</strong>. This is where you should keep any money that you plan to use in the next <strong>1-5 years</strong>, including your emergency fund. In a high-yield savings account, your money goes to work for you, and the account is also FDIC insured up to a quarter of a million dollars.</p>\n\n<h2>3. Roth IRA</h2>\n<p>Number three is a <strong>Roth IRA</strong>. This account is like the gold standard. Open up an account today through Schwab or Vanguard and contribute <strong>$50 a month</strong>. Invest that in low-cost index funds like Vanguard's <strong>VOO</strong>, and you’re all set. Remember, you can take back your contributions at any time, for any reason, and after age <strong>59 and a half</strong>, it’s all yours, including the gains, <strong>tax-free</strong>.</p>\n\n<h2>4. 401(k)</h2>\n<p>Your fourth account is a <strong>401(k)</strong>. If you have access to a 401(k) through your employer, you should be contributing something to that account. Automatically deduct it from your paycheck, and make sure you know if your company offers <strong>matching payments</strong>. If you’re not taking advantage of this, you are literally throwing money away!</p>\n\n<h2>5. Health Savings Account (HSA)</h2>\n<p>Number five is a <strong>health savings account (HSA)</strong>. This may seem like the least sexy account, but it's actually one of the most advantageous. When you get sick, you'll appreciate having an account where the money you contribute is tax-deductible, can grow over the years, rolls over from year to year, and is withdrawn tax-free for qualifying medical expenses.</p>\n\n<h2>6. Taxable Brokerage Account (Bonus)</h2>\n<p>Finally, number six is a <strong>taxable brokerage account</strong>. This is the cherry on top that will make you feel like a badass. Use this account to invest for plans you have <strong>5-10 years</strong> from now. Again, put <strong>$50 a month</strong> into a low-cost index fund, let it grow, and when you withdraw that money, the taxes you'll pay on capital gains are usually less than what you pay on ordinary income.</p>\n\n<p>Today, I just want you to open one of those accounts, or at the very least, read up on them. Commit to having all six of these accounts be part of your long-term financial plan. If any of this is helpful, please like and follow, and I will keep going for walks in the pouring rain just to help you get to where you need to be.</p>",
  "tags": [
    "Financial Accounts",
    "Savings",
    "Investing",
    "Wealth Building",
    "Personal Finance"
  ]
}