{
  "id": "3390978256071719033",
  "url": "https://www.instagram.com/p/C8PLMH6Onh5/",
  "datePosted": "2024-06-15T13:06:40.000Z",
  "shortCode": "C8PLMH6Onh5",
  "timestamp": "2024-06-15T13:06:40.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-det1-1.cdninstagram.com/o1/v/t16/f2/m82/AQOxngI7NnowjjMWHZ1Ie_-dJUdHkr7icdMEoK9kfBMJBXaldG9PSyXblHgiZH81mTARhSjfFA0zSn2Z4mFxJwjiGHRFKdsYge60hkY.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=104&vs=7889516794404396_2299205860&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC8yRDREM0NGQTlEMTc5QUVCMjg0NjNCQjMxMzNDRUNBQ192aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dGbUV0eG9OWkJuazAya0JBTGQwWE5WYVFUNHZicV9FQUFBRhUCAsgBACgAGAAbABUAACakj%2F7P1b6aQRUCKAJDMywXQFqqn752yLQYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=9b02ae111d&ccb=9-4&oh=00_AYGRWiuZUPM77baSTEhlUPMQPIYDhpmAaMaRaya_lpmlKg&oe=67D17C37&_nc_sid=10d13b",
  "videoPlayCount": 75750,
  "videoViewCount": 4318,
  "hashtags": [
    "money",
    "investing",
    "socialcap",
    "finance",
    "financialadvisor"
  ],
  "slug": "five-things-you-need-to-know-about-investing",
  "title": "5 Essential Principles for Investing Your Money",
  "subtitle": "Learn the key strategies and insights that can guide you toward successful investing and building wealth.",
  "content": "<h1>5 Essential Principles for Investing Your Money</h1>\n<p>Here are the only five things that you will ever need to know about investing your money. I'm Tyler, a former financial advisor and portfolio manager, and I create financial content for free to help you navigate your investment choices.</p>\n\n<h2>1. You’re Not Going to Beat the Market</h2>\n<p>So, in the words of <strong>Warren Buffett</strong>, invest in the <strong>S&P 500 Index Fund</strong>. The S&P tracks some of the United States' most profitable and stable companies and has returned over <strong>10%</strong> annually since its inception in <strong>1957</strong>.</p>\n\n<h2>2. The Core-Satellite Approach</h2>\n<p>If you insist on trying to beat the market, only use <strong>10%</strong> of your investable assets to do so, and invest the other <strong>90%</strong> in the S&P 500. This strategy is called the <strong>Core-Satellite Approach</strong>. If, or when, that 10% satellite money gets completely annihilated, you will still have 90% of your assets invested in the overall market.</p>\n\n<h2>3. Practice Dollar Cost Averaging</h2>\n<p>Practice <strong>dollar cost averaging</strong>. If you've ever feared investing when markets are low or jumped on the stock market bandwagon when stocks are soaring, this strategy is for you. Dollar cost averaging involves investing the same amount of money or the same percentage of your paycheck into the markets on the same day of each month, regardless of market conditions.</p>\n\n<h2>4. Minimize Fees</h2>\n<p>Make sure you minimize <strong>fees</strong>. While they may seem small in the short run, fees can destroy hundreds of thousands of dollars of your money in the long run. In investing, these fees are usually called <strong>expense ratios</strong>, and you want to invest in funds that track what you want them to track for the lowest possible expense ratio.</p>\n\n<h2>5. Only Invest What You’re Willing to Lose</h2>\n<p>Only invest what you're willing to lose. Investing in stocks grants access to unlimited gains, but you could also lose every single penny if a company goes under. With bonds, at best, you get your money back along with a few coupon payments. At worst, the company defaults and you receive a fraction of your money back, if anything at all.</p>\n\n<p>If any of this is helpful, please like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Investing Principles",
    "Financial Education",
    "Wealth Building",
    "Investment Strategy",
    "Personal Finance"
  ]
}