{
  "id": "3491233523879854191",
  "url": "https://www.instagram.com/p/DBzWmSCy0Bv/",
  "datePosted": "2024-10-31T20:45:53.000Z",
  "shortCode": "DBzWmSCy0Bv",
  "timestamp": "2024-10-31T20:45:53.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fssa21-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQMEJs7gbuG2RXhBABPQozugg_1OcIbrU4hP_8cCgTAoa7gG4Pcr04t2C3l36NhUX9lea0v_TYiPIYIjEKt7cOmV-AKWTdU4Yx5FCBs.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=110&vs=566351532743012_2099156109&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9CMTQ4NTNCQzc3MjYzRTU0M0M3MUY2NkI4MUIzNEE5MF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dObUh1aHNqalJJTDRwRUZBSXRBaG9GN3J6ZEFicV9FQUFBRhUCAsgBACgAGAAbABUAACbS2bXMpt2NQBUCKAJDMywXQFLEOVgQYk4YEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=767e153f29&ccb=9-4&oh=00_AYGIXbh8tVZe4NaHkCfdVJ6CLLvUp9lSU_II6BdKlhYQ7w&oe=67D17208&_nc_sid=10d13b",
  "videoPlayCount": 584605,
  "videoViewCount": 294244,
  "hashtags": [
    "money",
    "rothira",
    "finance",
    "hysa",
    "wealth",
    "socialcap",
    "invest"
  ],
  "slug": "five-things-i-will-not-do-with-my-money-heading-into-2025",
  "title": "Five Key Financial Decisions to Avoid for a Successful 2025",
  "subtitle": "Explore five crucial financial moves to steer clear of as you plan for a prosperous 2025, and ensure your monetary strategies are effective and beneficial.",
  "content": "<h2>Five Things I Will Not Do With My Money Heading Into 2025</h2>\n<p>Hello, I'm Tyler, a former financial advisor and portfolio manager. I now create financial content for free so you don't have to pay for it. Here are five things I will avoid with my money as we approach 2025:</p>\n\n<h3>1. Not Keeping Money in a High-Yield Savings Account</h3>\n<p>I will not keep my money in a high-yield savings account thinking it’s a good long-term investment. By definition, it's not an investment at all. It's great for short-term needs, but with interest rates dropping, if this is for your long-term goals, wouldn't you rather have the return on that money going up, not down?</p>\n\n<h3>2. Not Investing Heavily in Stocks</h3>\n<p>I would not invest too heavily in stocks if you haven't already. The market has been on a tear, and while I don’t have a crystal ball and don't time the market, I can assure you that the reckoning is coming. When it does, you always want to leave yourself an out if it's the only money you've got.</p>\n\n<h3>3. No Longer Investing in a Roth IRA</h3>\n<p>I will no longer be investing in a Roth IRA. Being over 40 and in a higher tax bracket, I believe I’ll be in a much lower tax bracket when I retire and start taking distributions. I’d prefer to take advantage of the tax benefits now in traditional and pre-tax accounts rather than in a Roth.</p>\n\n<h3>4. Not Paying Off My Mortgage Early</h3>\n<p>I still would not put one extra dime towards paying off my mortgage early. I locked in a 30-year fixed rate at 3.25%. As long as I can continue to achieve guaranteed post-tax returns elsewhere, I’ll appreciate having cheap debt.</p>\n\n<h3>5. Continuing to Cut My Own Hair</h3>\n<p>Lastly, I’m still not going to pay for a haircut. It’s been five years of self-cuts, and it certainly beats whatever was happening to my head at Supercuts. Although that tea tree massage was worth the 20 bucks!</p>\n\n<p>If any of this has been helpful, please like and follow for more tips, and I’ll continue to help you get one step closer to where you need to be.</p>",
  "tags": [
    "Financial Planning",
    "Investing Tips",
    "Retirement Strategies",
    "Money Management",
    "Personal Finance"
  ]
}