{
  "id": "3413686441601611657",
  "url": "https://www.instagram.com/p/C9f2btuOzeJ/",
  "datePosted": "2024-07-16T20:54:25.000Z",
  "shortCode": "C9f2btuOzeJ",
  "timestamp": "2024-07-16T20:54:25.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-ord5-1.cdninstagram.com/o1/v/t16/f2/m86/AQPp27caiXoutQGxcPHg3xO4GayeZ4AUb_vIaFb-g0kNkdc5BVYeBK1jROkgmP-UFn2oLL8E6AQ2q32OwGIihZHlLE8sBARoZoT-t_U.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=108&vs=857879652872595_712324953&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9CMzRDMjFCQkE5MDM4NDUzQ0I2REUwNjcwNkZDOTE5NV92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dLdkU2eHJseVh1NExOVU5BUC1kaWcwXzVNWkJicV9FQUFBRhUCAsgBACgAGAAbABUAACb44YD79pHEQRUCKAJDMywXQFgRBiTdLxsYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=0d32ab5d84&ccb=9-4&oh=00_AYGbmcp5pdAEr-B72Q6HGBavxOH2Q_l14rx9vCIshNfcRA&oe=67D173DB&_nc_sid=10d13b",
  "videoPlayCount": 54269,
  "videoViewCount": 16327,
  "hashtags": [
    "invest",
    "indexfund",
    "investing",
    "financialadvisor",
    "wealth",
    "money",
    "socialcap"
  ],
  "slug": "four-critical-things-before-investing-in-index-funds",
  "title": "Four Critical Things to Consider Before Investing in Low-Cost Index Funds",
  "subtitle": "Discover the key factors to evaluate before investing in index funds, including fees, fund benchmarks, holdings, and more to maximize your investment strategy.",
  "content": "<p>If I were to invest $1,000 of my money into a low-cost index fund today, here are four critical things I would do before investing that money. And the fifth is how I would actually invest the money.</p><p>I'm Tyler, a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p><h2>1. What Are the Fees?</h2><p>I look for an expense ratio fee of under 0.05% because that will save me about 20 times the fees of what it would cost me to pay a financial advisor to put my money in the exact same type of fund.</p><h2>2. What Does the Index Fund Track?</h2><p>The S&P 500, the NASDAQ, the SSE Composite? There is no right answer, but you need to make sure you match the index, the group of companies in which you want to invest, with the type of strategy you want to use.</p><h2>3. What Are the Top Holdings in That Index?</h2><p>This is huge, as many indexes today are market cap weighted, meaning that the bigger and more profitable companies, like Nvidia, Amazon, Apple, and Meta, will dominate the overall performance of the index. For example, the S&P 500's performance is almost entirely dictated by just six companies.</p><h2>4. Is It a Passive or Active Fund?</h2><p>A passive index fund does nothing but track the index and try to match its performance. It's like the humble advisor who knows they're not gonna beat the market. Many of these funds now are actively managed by real people who are trying to beat the index. Not only will they fail to do so on a consistent basis, but they'll probably end up charging you about 1% just for their valiant efforts.</p><h2>5. My Investment Strategy</h2><p>So number five, and I know you'll always call me boring, I would and always will just dollar cost average into a passive fund that tracks the S&P 500 for under 0.05%. This tracks the most stable and profitable companies in the US.</p><p>If any of this is helpful, like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Index Funds",
    "Investing Tips",
    "Financial Planning",
    "Expense Ratios",
    "Dollar Cost Averaging"
  ]
}