{
  "id": "3410584708998437527",
  "url": "https://www.instagram.com/p/C9U1LkIOxqX/",
  "datePosted": "2024-07-12T14:13:29.000Z",
  "shortCode": "C9U1LkIOxqX",
  "timestamp": "2024-07-12T14:13:29.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fbkk5-6.fna.fbcdn.net/o1/v/t16/f2/m86/AQOwYQ9poKLyUl0WNIrKmAGTv5hw83qT8j7tD2Ns7W2PrV-1ID7SXN9IQHDFUitvn7IQpvdmMQDFLO4hBdVM8Qo5EJzBUjwEqhAZJdM.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=101&vs=845856667066656_1703871074&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC81NzQ1RkNBQ0FCMkIwMDcyN0JBNDFFQTU1Rjc3MzdBMF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dQbmM0aHA3UTNoUjVKd0RBUEdNUzM1TXRCWlBicV9FQUFBRhUCAsgBACgAGAAbABUAACb%2BpJ3WwauKQBUCKAJDMywXQFjzMzMzMzMYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=7efa90d910&ccb=9-4&oh=00_AYGN5yMB73hnofJo7is9wovhrZifFHqGdMzU8UVVsjzXFg&oe=67D15407&_nc_sid=10d13b",
  "videoPlayCount": 31782,
  "videoViewCount": 11558,
  "hashtags": [
    "fees",
    "financialadvisor",
    "money",
    "wealth",
    "socialcap"
  ],
  "slug": "hidden-financial-advisor-fees",
  "title": "Top 5 Hidden Financial Advisor Fees You Must Watch Out For",
  "subtitle": "Discover the crucial hidden fees charged by financial advisors that could significantly impact your investment returns. Understand fund fees, fund of fund fees, and more to make informed financial decisions.",
  "content": "<h1>Top 5 Hidden Financial Advisor Fees You Must Watch Out For</h1>\n<p>If you are thinking about working with a financial advisor, here are five fees that you might end up paying if you're not watching closely.</p>\n<p>I'm Tyler, a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p>\n\n<h2>1. Fund Fees</h2>\n<p>Regardless of how much your advisor charges you for their services, you also will pay the fees of every single fund that they put you in. This can range from <strong>0.05%</strong> for low-cost index funds to upwards of <strong>3%</strong> for some alternative investment mutual funds.</p>\n\n<h2>2. Fund of Fund Fees</h2>\n<p>Even worse, your advisor might get really lazy and just stick your money in a fund that has a bunch of other mutual funds in it. You’re then paying your advisor fee, the fund of funds fee, and all of those funds fee. This could total about <strong>5%</strong> very quickly and give you a <strong>0%</strong> chance of achieving your long-term goals.</p>\n\n<h2>3. Front End Load Fees</h2>\n<p>For some mutual funds, you get charged a hefty fee just to have the privilege of being put into the fund. By law, this can be up to <strong>8.5%</strong> of your initial investment. Think about that; that's a great annual return for the S&P 500, gone because of one fee. These usually range from <strong>3%</strong> to <strong>6%</strong>.</p>\n\n<h2>4. Back End Load Fees</h2>\n<p>You can also get charged that same hefty fee when you leave the fund. These range from <strong>5%</strong> to <strong>7%</strong> of your investment. Yes, they do decrease as you spend more time in the fund. But if you want out of that fund quickly, just like annuities, they'll eat you alive.</p>\n\n<h2>5. 12B-1 Fees</h2>\n<p>This is a very common one that <strong>99%</strong> of you are most likely paying. These are fees that are paid directly to your financial advisor for recommending selling certain mutual funds. Yes, they get a kickback. This does seem like a conflict of interest.</p>\n\n<p>If any of this is helpful, like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advisor Fees",
    "Investment Costs",
    "Mutual Funds",
    "Financial Planning",
    "Hidden Costs"
  ]
}