{
  "id": "3417334717399800882",
  "url": "https://www.instagram.com/p/C9sz9HVOZwy/",
  "datePosted": "2024-07-21T21:43:27.000Z",
  "shortCode": "C9sz9HVOZwy",
  "timestamp": "2024-07-21T21:43:27.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-atl3-2.cdninstagram.com/o1/v/t16/f2/m86/AQMjdDlhDqyXUjdEYP6n5F8n8R5sR8rAcFxcLLZhdZMoarq9ZoByt_lwprT-iTpqPwj174wI3nTXr2-oMUvCNDJkHe-6_rxNjxSkR4I.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=105&vs=795619599222449_2228516358&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9CMzRFRDgyRjE3MERGOUI5RDE0NjE2RjhFQ0ZDOTk4Rl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dGMDV2UnJFZXE2WTJKQUJBSl9CTDJrbGhWNGdicV9FQUFBRhUCAsgBACgAGAAbABUAACa2rrGNkoD5PxUCKAJDMywXQFYKn752yLQYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=0e859decf8&ccb=9-4&oh=00_AYHRU_tYHoVV585CMNj_Gx8lxnfkUBGyip75reFkND4otw&oe=67D144FD&_nc_sid=10d13b",
  "videoPlayCount": 112883,
  "videoViewCount": 28175,
  "hashtags": [
    "DIY",
    "invest",
    "stockmarket",
    "money",
    "wealth",
    "investing",
    "finance",
    "socialcap"
  ],
  "slug": "how-to-beat-the-stock-market-as-a-do-it-yourself-investor",
  "title": "How to Beat the Stock Market as a Do-It-Yourself Investor",
  "subtitle": "Learn the essential strategies to outperform the stock market as a DIY investor with insights on contrarian bets, future theses, and risk management.",
  "content": "<h2>If you're a do-it-yourself investor and you want to beat the stock market, then you need to do the following three things:</h2>\n<p>I'm Tyler, a former financial advisor and portfolio manager. Now, I create financial content for free, so you don't have to pay for it.</p>\n\n<h3>1. Make a Contrarian Bet</h3>\n<p>If you've already heard about an investment on social media or <em>Mad Money</em>, it's too late. Everyone's likely already made that move, and you could end up losing your money. For example, if you think Nvidia is not actually the next big success, consider underweighting it in your portfolio from its current 5.06% of the S&P 500 to about 3%. If Nvidia's price drops, you stand to gain.</p>\n\n<h3>2. Have a Thesis About the Future</h3>\n<p>Remember that skill you learned in English class? It's not useless after all. If your thesis is that we're entering a golden age of innovation and AI, invest heavily in consumer discretionary and information technology. Conversely, if you believe the economy is on the verge of collapse, focus on consumer staples and healthcare. Just throwing darts in random directions will lead most likely to average results.</p>\n\n<h3>3. Always Leave Yourself an Out</h3>\n<p>As Mikey McDermott famously said in the film <em>Rounders</em>, it’s vital to always leave yourself an exit strategy. If 90% of active portfolio managers—those equipped with time, expertise, and resources—fail to beat the overall market, your chances are slim. That’s why I allocate only 10% of my investable assets to attempt to outperform the market each year, while the remaining 90% is placed in a low-cost index fund tracking the S&P 500.</p>\n\n<p>If you find this information helpful, please like and follow, and I'll continue to help guide you on your investment journey!</p>",
  "tags": [
    "Investing Strategies",
    "Stock Market Tips",
    "Personal Finance",
    "Contrarian Investing",
    "DIY Investing"
  ]
}