{
  "id": "3381821740936711121",
  "url": "https://www.instagram.com/p/C7upPSqOcvR/",
  "datePosted": "2024-06-02T21:44:49.000Z",
  "shortCode": "C7upPSqOcvR",
  "timestamp": "2024-06-02T21:44:49.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fgyd20-2.fna.fbcdn.net/o1/v/t16/f2/m82/AQPl-jOe5SZMXHHnyMnd9UD1mdCjuvJ_kp_gsgcgEGmASYmXuThNcttq-nPv6Dme8fDKwQuVKunPBfs4DkPgJgejrjlb-yv-m4F23AY.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=100&vs=345604955298307_2334259716&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC9DNjRGQUI4QzFCQjFFMDhDRTI0QjM4NDJEODU2Mzk4RF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dGbS1wQm9GSnNleVlJTURBSUFtZXgxaDN3YzFicV9FQUFBRhUCAsgBACgAGAAbABUAACacyMfpvoviQBUCKAJDMywXQGAd2yLQ5WAYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=a0c6431cbb&ccb=9-4&oh=00_AYELbm-UKA1X3hOZxooLb-57Vq9YcKpMbXqlyoFdwVhvtA&oe=67D1475D&_nc_sid=10d13b",
  "videoPlayCount": 93468,
  "videoViewCount": 3049,
  "hashtags": [
    "cardealership",
    "finance",
    "financialliteracy",
    "personalfinance",
    "money",
    "cardealer"
  ],
  "slug": "how-to-save-thousands-at-car-dealerships",
  "title": "How to Save Thousands at Car Dealerships: The Truth About Financing",
  "subtitle": "Learn the secrets to saving money when leasing or purchasing a vehicle. Discover why focusing on monthly payments can cost you in the long run.",
  "content": "<h1>How to Save Thousands at Car Dealerships: The Truth About Financing</h1>\n<p>I'm going to get a lot of hate from car dealerships for telling you this story. And by knowing this, you will literally save tens of thousands of dollars over the course of a lifetime.</p>\n<p>You know who gets paid the most money at a car dealership? That's right. The finance person. You know why? Because they're brilliant at screwing you and making it seem like you're screwing them.</p>\n<h2>My First Car Buying Experience</h2>\n<p>So about 20 years ago, I had just gotten my first job. And you know what that means. My first paycheck. And you know what that means. Oh yeah. I was gonna spend every single penny. So I decided to lease a brand new car.</p>\n<p>I picked out the car, found it in stock at a local dealership, and armed with nothing more than the overconfidence of a 22-year-old, went to work out the details. And that dealership could smell me coming from a mile away. Relatively young, ridiculously eager to make that purchase, and absurdly naive as to how they were going to screw me.</p>\n<h2>The Negotiation</h2>\n<p>I sat down with the first salesman that came my way, told him what I wanted, and he said, <i>\"Great choice.\"</i> I know. I said. You seem to know exactly what you're looking for. He said. I do. I said. Well, we can give you that car. He said. For the low price of $400 a month for 36 months with no money down.</p>\n<p>Not so fast, buddy. I didn't say but wanted to. That is too expensive. He hemmed and hawed, went to the manager's office, came back out after about a half an hour. Fine. He said. You drive a tough bargain. We can knock it down to $375 a month for 39 months. This way you get to keep the car for longer.</p>\n<p>Eh? You're not fooling anybody, car guy. I retorted. Still too expensive. Oh, I was gonna win this game if it took me all day. Again. Went to his manager, pretended to talk about something other than how much he was gonna screw me, and then came back out to screw me.</p>\n<h2>Finalizing the Deal</h2>\n<p>Fine. I said. This is only because we've already reached our monthly quota and we just need to move some cars. We're probably losing money on this. We can do $350 a month for 36 months with just $2,000 down. I was like, <i>\"Deal.\"</i> I had the cash, I had hit my monthly target of $350, and I walked out of there like a triumphant young king who had just conquered Rome.</p>\n<p>Turns out the car dealership had just conquered my bank account. Even though the monthly payment had gone down, the total cost to me had actually gone up on every single one of those offers. Because all I was focused on was that monthly payment, I thought I had won.</p>\n<h2>Moral of the Story</h2>\n<p>The moral of the story? Never talk monthly payments. You give me five minutes with a financial calculator and I'll have you pay any single monthly you want. And I will still win. Talk MSRP or nothing at all.</p>",
  "tags": [
    "Car Buying Tips",
    "Finance Secrets",
    "Save Money",
    "Leasing a Car",
    "Car Dealerships"
  ]
}