{
  "id": "3387338283451774054",
  "url": "https://www.instagram.com/p/C8CPjjPOXRm/",
  "datePosted": "2024-06-10T12:25:53.000Z",
  "shortCode": "C8CPjjPOXRm",
  "timestamp": "2024-06-10T12:25:53.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fosu2-2.fna.fbcdn.net/o1/v/t16/f2/m82/AQOWaZb-Dx70otrdyuiW26LKHXGMUBTUTmtn5_e5YAd1Cn0nF8CHLo2ujHDycNnYjulUK_CxQuw45X10JBDJIkMAEguH_W6DTC2kHoY.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=110&vs=825163362500808_592914388&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC8zQjQwMTUwMzBFNTcyMzVEMDExOTU3RkZFMjE5MzBCMl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dCRVB0Um9TU3g4Z2FvSUJBQ1pqUzZpVTVQaGticV9FQUFBRhUCAsgBACgAGAAbABUAACaou86WjqWYQBUCKAJDMywXQFRMzMzMzM0YEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=d964d5aba1&ccb=9-4&oh=00_AYGSlhhir2r8DF5JKD-PIAoSwMQZW9hjlkSfbsXQMwbENg&oe=67D15008&_nc_sid=10d13b",
  "videoPlayCount": 31519,
  "videoViewCount": 3765,
  "hashtags": [
    "financialadvisor",
    "finance",
    "money",
    "wealth",
    "investing",
    "socialcap"
  ],
  "slug": "lessons-from-a-bad-financial-advisor",
  "title": "3 Reasons Why I Was One of the Worst Financial Advisors",
  "subtitle": "Discover the valuable lessons learned from my experiences in financial advising and how they can help you make informed choices.",
  "content": "<h1>3 Reasons Why I Was One of the Worst Financial Advisors</h1>\n<p>Here are the three reasons why I was one of the worst financial advisors and portfolio managers in the history of the industry. I'm Tyler, a former financial advisor and portfolio manager, and now I create financial content for free so you don’t have to pay for it.</p>\n\n<h2>1. Struggling with Networking</h2>\n<p>I was terrible at building out my network of prospective clients. I like to build my relationships based on trust and authenticity, which I found difficult to achieve when I knew I was only building these relationships to inevitably ask if I could manage their money.</p>\n\n<h2>2. Awful at Closing Deals</h2>\n<p>I was awful at closing the deal. Financial advising is primarily a sales job, and to be great in sales, you need to truly believe in the product or service you provide. I wanted to teach people how to manage their money, not get paid a small fortune to do it for them.</p>\n\n<h2>3. Questioning Fee Structures</h2>\n<p>I did not believe the services rendered justified the fees received. Charging a percentage of assets under management is, at best, ridiculous, and at worst, unethical. I could allocate a <strong>$10,000</strong> portfolio across asset classes just as quickly as I could allocate a <strong>$10 million</strong> portfolio. Yes, there's an app for that! Good portfolio theory remains the same regardless of how much money you have. So why would I receive <strong>100 times the fee</strong> for the exact same job?</p>\n\n<p>So yeah, I was one of the worst financial advisors in the history of the business, and now I make content for free. Maybe it’s helpful, and maybe it’s not. But if it is helpful, please like and follow, and I’ll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advising",
    "Investment Management",
    "Lessons Learned",
    "Networking",
    "Ethics in Finance"
  ]
}