{
  "id": "3812145789615767125",
  "url": "https://www.instagram.com/p/DTndmXmDH5V/",
  "datePosted": "2026-01-17T15:20:37.000Z",
  "shortCode": "DTndmXmDH5V",
  "timestamp": "2026-01-17T15:20:37.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-atl3-2.cdninstagram.com/o1/v/t16/f2/m69/AQPj5-K-VLrW6dlvYFNRuuHxAtDWBJIAbLuWB0pTL6fpRmH-UW_tBoq9ECVUObDFla30ud-qbhcADE6x0mILkT1T.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=105&vs=2184824142260012_319689598&_nc_vs=HBksFQIYOnBhc3N0aHJvdWdoX2V2ZXJzdG9yZS9HT0tEemlSeVM3bUxIRWtDQUxJVjE5RVpvUG9oYnNwVEFRQUYVAALIARIAFQIYUWlnX3hwdl9wbGFjZW1lbnRfcGVybWFuZW50X3YyLzVBNEM0N0JFNjU1MUFDQjAyNURGQkU1QTc5NkQyRDk0X2F1ZGlvX2Rhc2hpbml0Lm1wNBUCAsgBEgAoABgAGwAVAAAm5qa5xtOHxT8VAigCQzMsF0BXwAAAAAAAGBJkYXNoX2Jhc2VsaW5lXzFfdjERAHX%2BB2XmnQEA&_nc_rid=94200d4502&ccb=9-4&oh=00_AfqK6XXaEEvd9xHDkfoUI93BIFb9qLWHegEKSvTV7Ivkeg&oe=696E2058&_nc_sid=10d13b",
  "videoPlayCount": 119569,
  "videoViewCount": 47407,
  "hashtags": [
    "money",
    "wealth",
    "finance",
    "tyler"
  ],
  "slug": "my-investment-strategy",
  "title": "My Personal Investment Strategy Revealed",
  "subtitle": "A Transparent Approach to Building Wealth with Four Simple Funds",
  "content": "<h1>Here's How I Invest My Money</h1>\n<p>No gatekeeping here! I'm Tyler, a former financial advisor and portfolio manager, and now I make financial content for free so you don't have to pay for it.</p>\n\n<h2>1. Core Holding: 70% in FXAIX</h2>\n<p>My core holding is 70% in FXAIX, Fidelity's S&P 500 index with a 0.15% expense ratio. This fund contains 100 of the biggest US companies. It's market-cap weighted, so if companies do well, I automatically own more of them. If they perform poorly, I own less or none at all since they can get kicked out of the index. By design, this can't go to zero, and it beats 99% of active managers.</p>\n\n<h2>2. Growth Potential: 10% in VIGAX</h2>\n<p>I invest 10% in VIGAX, Vanguard's growth fund, which is tech-heavy, more volatile, but offers higher upside. I bought this 20 years ago, and it's gone up massively. If I sold, I'd face a significant capital gains tax. Instead, I let it ride because tax efficiency is more important than perfection, and I don't need that money today. Would I buy more today? No, as FXAIX covers most of those companies anyway.</p>\n\n<h2>3. International Exposure: 10% in VXUS</h2>\n<p>I allocate 10% to VXUS, Vanguard's international stock fund. Since 40% of the world's market cap is outside the US, I want exposure to that. Additionally, I don't know which country will perform best next year—it doesn’t matter because I own it all.</p>\n\n<h2>4. Liquidity: 10% in SPACs</h2>\n<p>Finally, I put 10% into SPACs, Fidelity's money market fund. It returns short-term interest rates and stays highly liquid. I use this fund for paying quarterly taxes or for any immediate purchases, like a new vest. This option is way better than letting my money sit in a checking account earning nothing.</p>\n\n<h2>Conclusion</h2>\n<p>With just four simple funds, I maintain a low-cost, tax-efficient portfolio, and rebalancing takes about 15 seconds a year. If any of this is helpful, sign up for my free weekly newsletter by clicking the link in my bio. Each week, I'll send you over another money playbook that actually works.</p>",
  "tags": [
    "Investing",
    "Financial Strategy",
    "Roth IRA",
    "ETF",
    "Stock Market"
  ]
}