{
  "id": "3477964609056982591",
  "url": "https://www.instagram.com/p/DBENmKIOMY_/",
  "datePosted": "2024-10-13T13:23:15.000Z",
  "shortCode": "DBENmKIOMY_",
  "timestamp": "2024-10-13T13:23:15.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fbll1-2.fna.fbcdn.net/o1/v/t16/f2/m86/AQOUDP59pYqcQLpwAo7U-D0c2cmamW-HWA8XcK-_mVBHX2xSCLS3fZkLyldVdGqyIx6b_3J85n3_KvbsBkYYUBfAlpKlYTq_Vw2tvyk.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=109&vs=1258229748527373_190460288&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC85RjQ3RjhCOUM5RTMwMjI4Rjg4REM4QTc2MEQ4MjVBNl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dKR2xsQnV0WEhmSjdZRUVBSUR5MmF5TUo4bEpicV9FQUFBRhUCAsgBACgAGAAbABUAACbe8JrGqLypQBUCKAJDMywXQFXGZmZmZmYYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=63968a8262&ccb=9-4&oh=00_AYE2TEtsNIBNvHlRwkZgFIntscOqmALmoc2wlkGoJu2O0A&oe=67D1580D&_nc_sid=10d13b",
  "videoPlayCount": 2633821,
  "videoViewCount": 774797,
  "hashtags": [
    "invest",
    "money",
    "financialadvisor",
    "investing",
    "wealth",
    "socialcap"
  ],
  "slug": "my-investment-portfolio-as-a-former-portfolio-manager",
  "title": "Insight into My Investment Portfolio: A Former Portfolio Manager's Strategy",
  "subtitle": "Discover how a former portfolio manager allocates investments to minimize taxes and maximize stability in various accounts, including Roth IRA, rollover IRA, and brokerage accounts.",
  "content": "<h1>My Investment Portfolio</h1>\n<p>Here is exactly how I am invested across my entire portfolio as a former portfolio manager. I'm Tyler, a former financial advisor and portfolio manager. Now, I make financial content for free so that you don't have to pay for it.</p>\n<h2>1. Roth IRA</h2>\n<p><strong>100% of my assets are in Invesco's QQQM.</strong> It's aggressive, and I don't want to pay a dime of capital gains tax after 40 years of growth.</p>\n\n<h2>2. Rollover IRA</h2>\n<p>In my rollover IRA, I'm invested <strong>60% in Fidelity's FXAIX, 30% in Vanguard's VOO, and 10% in Invesco's QQQM.</strong> This provides me with low-cost exposure to the S&P 500 through an index fund and an ETF, allowing me to overweight tax for the long term. This is where I rolled over all of my old 401(k)s to avoid hefty administrative fees and allow greater flexibility in investment options.</p>\n\n<h2>3. Taxable Brokerage Account</h2>\n<p>In my taxable brokerage account, I'm invested <strong>100% in Vanguard's VIGAX.</strong> I would rebalance to take a little bit of risk off at this point in my life, but the capital gains are high enough now after about 20 years of investing. The benefit does not outweigh the tax hit.</p>\n\n<h2>4. Money Market Fund</h2>\n<p>Finally, I have about <strong>$20,000 in Fidelity's money market fund, SPRXX,</strong> earning about 4.5%. This serves both as my emergency fund and immediate liquidity for short-term goals.</p>\n\n<p>Investing this way, I keep costs between 0.02% and 0.15%. I eliminate most tax inefficiencies and pay $0 in load fees, portfolio turnover fees, or active management fees. Most importantly, I have broad exposure to the most profitable and stable companies in the world. And I sleep well at night knowing that I can count my investment funds on one hand.</p>",
  "tags": [
    "Investment Strategy",
    "Portfolio Management",
    "Financial Advising",
    "Tax Efficiency",
    "Index Funds"
  ]
}