{
  "id": "3379386330767787041",
  "url": "https://www.instagram.com/p/C7l_faMOYQh/",
  "datePosted": "2024-05-30T13:06:44.000Z",
  "shortCode": "C7l_faMOYQh",
  "timestamp": "2024-05-30T13:06:44.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-ord5-2.cdninstagram.com/o1/v/t16/f2/m82/AQPHwcg-E3mIutw7rjR883RvfzyEgxbY5rOEOaqU-pZbji_eWKIGyGlo87nRUK9szjM0qyUeymdUx3m98qVjbD4ClfuQ2XydLgyVQWE.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=105&vs=348365087969636_460611142&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC80ODQ2MkQ0OUVCMTdGQzA1MjkzNDQ3MjkyMTYyMTQ4OF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dBQTRvQnBpaWh5VDAzWUdBQ0dRcURUV2h3NHRicV9FQUFBRhUCAsgBACgAGAAbABUAACaQ3KbW0fyYQBUCKAJDMywXQGYUQYk3S8cYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=bbe90ad713&ccb=9-4&oh=00_AYHMkwwevMz89FGDBv-kDmRjfSOCsAqY7HkDwVKvHWdL_Q&oe=67D170B9&_nc_sid=10d13b",
  "videoPlayCount": 52133,
  "videoViewCount": 2980,
  "hashtags": [
    "wealth",
    "financialfreedom",
    "rich",
    "tax",
    "retirement",
    "brokerage",
    "finance",
    "money",
    "socialcap",
    "investing"
  ],
  "slug": "pay-yourself-first-tips-for-financial-freedom",
  "title": "Pay Yourself First: Essential Tips for Achieving Financial Freedom",
  "subtitle": "Discover the powerful habit of paying yourself first to save on taxes and work towards financial freedom. Learn how to automate your savings effectively.",
  "content": "<h1>Pay Yourself First: Essential Tips for Achieving Financial Freedom</h1>\n<p>I don't know who needs to hear this right now, but if we just practice this one habit, we would not only be saving tens of thousands of dollars in taxes each year, we would also be setting ourselves up for that one thing that all of us want so badly—financial freedom.</p>\n<p>Ever wonder why Fubo and other streaming services will let you have a free trial and all you have to do is give them your credit card number in advance? I know, it seems like such a good deal. I can just sit here and make up endless fictitious Gmail accounts and watch my favorite show or sporting event. And <strong>Bob Bobson at Gmail.com</strong>, I definitely owe you a personal apology for the five years of spam that you probably have been getting.</p>\n<p>Fubo and other streaming services offer these trials because they know you. They know that no matter how many times you tell yourself you're going to quit in the morning, you're not going to quit. You might remember to quit once. You might even remember to quit twice. But quit three times? You show me the person who remembers to quit three times, and I'll show you an indexed universal life policy that's a good idea for a long-term investment.</p>\n<p>One day life is simply going to get in the way. Because you automated that cash outflow, let me repeat that, because you automated that cash outflow, you left yourself wide open to forgetting about it. And yeah, now you're paying <strong>$79.99</strong> a month to watch highlights of Wife Carrying Out of Finland on ESPN 12. Oh, it's a thing.</p>\n<p>Now, what if we were to use that same psychology to our advantage? Instead of automating payments that we forget about to make other people rich, let’s automate payments that hopefully we forget about to make ourselves rich. This way, when we forget about the payments, we’re just going to be making our future selves super rich. “Oh, thanks, past Tyler. You’re welcome, future Tyler.”</p>\n<p>But before that paycheck even hits your bank account, you need to do the following <strong>four things</strong>:</p>\n<ol>\n  <li><strong>5% to 10%</strong> of that paycheck should go directly into a <strong>401k</strong> or a <strong>Roth IRA</strong>. Not past go, not collect that $200. Put that $200 into a tax-advantaged account and invest it in low-cost index funds.</li>\n  <li><strong>3%</strong> of that money should go directly into an <strong>emergency savings account</strong> where you use either a high-yield savings account or a money market fund. There are no tax advantages here, but it’s a great way to protect the purchasing power of your money against inflation.</li>\n  <li><strong>3%</strong> of that money should go directly into a <strong>taxable brokerage account</strong> and automatically invest it in a low-cost index fund. Remember that long-term capital gains taxes—those will usually be less than the taxes you pay on your ordinary income.</li>\n  <li><strong>3%</strong> of that paycheck should go directly into a <strong>health savings account</strong> if you're lucky enough to work for an employer who offers you one.</li>\n</ol>\n<p>This is like the gold standard of financial accounts. Contributions are tax-deductible, you can invest that money in the markets, and the funds roll over from one year to the next, so you never lose them. And yeah, that means that your paycheck is probably going to be a little less than it is right now. That sucks. But what doesn’t suck is that it's not as much of a pay cut as you actually think because a lot of that money would have been going to the government in the form of taxes anyway.</p>\n<p>This way, you’re literally taking money off the table from the government and putting it right back where it belongs—in your own pocket. And this, my friends, is what people mean when they say <strong>pay yourself first</strong>.</p>",
  "tags": [
    "Financial Freedom",
    "Tax Savings",
    "Investing Tips",
    "Automated Savings",
    "Personal Finance"
  ]
}