{
  "id": "3426484708680738637",
  "url": "https://www.instagram.com/p/C-NUbAxOSdN/",
  "datePosted": "2024-08-03T12:42:39.000Z",
  "shortCode": "C-NUbAxOSdN",
  "timestamp": "2024-08-03T12:42:39.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-ord5-3.cdninstagram.com/o1/v/t16/f2/m86/AQNpYVZTtk_xPjUDRmB_lVOKxZJ2InsgdHDUBkVPm8kRG1FWii3wlyw7Y8HcddppMK_-oL8ToHGvoK8bLuQUIzfnfYWUdjRQhbhtlCE.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=107&vs=343771995476960_3175424703&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC8yQTRFNkYxMkJFNTgxRjQ4QTIzMDc5QUIxMDYwQjQ4M192aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dJQVlFQnNkcUZ0UGtjVURBQmIydFZuWWFhRmpicV9FQUFBRhUCAsgBACgAGAAbABUAACbM6JGhpZ%2F2PxUCKAJDMywXQFOqn752yLQYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=3d2b4326bf&ccb=9-4&oh=00_AYEPA_-p2ofgM6c6EmLZeXEYHjLLIBLP163rvWZYUgv97g&oe=67D15247&_nc_sid=10d13b",
  "videoPlayCount": 215754,
  "videoViewCount": 104049,
  "hashtags": [
    "taxes",
    "buisness",
    "entrepreneur",
    "irs",
    "taxcode",
    "finance",
    "wealth",
    "money"
  ],
  "slug": "separating-rich-from-middle-class",
  "title": "The Key Difference Between the Rich and the Middle Class: Understanding Financial Freedom",
  "subtitle": "Discover how the wealthy leverage their businesses and investments to minimize taxes and achieve true financial freedom. Learn the mindset shifts required to escape the typical 9 to 5 grind.",
  "content": "<h1>The Key Difference Between the Rich and the Middle Class</h1>\n<p>Here's the number one thing that separates the rich from the middle class, and you're not gonna like it. I'm Tyler, I'm a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p>\n\n<h2>The Middle Class Lifestyle</h2>\n<p>Number one, the middle class wakes up every day, goes to work for somebody else, works 40 hours a week, 50 weeks a year, is a W-2 employee, gets a paycheck, pays their taxes, complains about paying those taxes, and then uses what's left to barely cover utilities, gas, electric, mortgage, childcare, et cetera.</p>\n\n<h2>The Wealthy Approach</h2>\n<p>Number two, the rich do it a little differently. They create their own businesses, wake up whenever they want, work the hours that they want, and earn revenue for their business. But then instead of paying taxes on that revenue, yeah, they don't have to do that.</p>\n\n<h2>Reinvesting for Success</h2>\n<p>They immediately reinvest almost every penny of that money back into the business to make them even more money in the future. Only after they find every single imaginable way to reinvest money into their business to keep it growing, do they present their net income to the IRS, which is typically, and unsurprisingly, a fraction of their total revenue. By doing that, they pay almost zero in taxes.</p>\n\n<h2>Shifting Your Mindset</h2>\n<p>So just remember, you can spend your life complaining about taxes, or you can wake up, snap out of this nine to five world, and learn how to not pay taxes by doing exactly what the government wants you to do. Gotta love America. And if any of this is helpful, like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Freedom",
    "Tax Strategies",
    "Wealth Building",
    "Entrepreneurship",
    "Mindset Shift"
  ]
}