{
  "id": "3401219618306056941",
  "url": "https://www.instagram.com/p/C8zjzjwOOLt/",
  "datePosted": "2024-06-29T16:08:08.000Z",
  "shortCode": "C8zjzjwOOLt",
  "timestamp": "2024-06-29T16:08:08.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fcgh39-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQMgS1iC_VHJyVYPA9RumaPV_KdaZxuPsFJqTRxMzCYGdE1D0fDzhDTOg1YLRfNn-Ffm8VM7ba_s3iooNAdwts-OO91gFV9BMDIWNBk.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=101&vs=386123747777603_1173172566&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9BRjQzMjZEMTIwQkQ2NjA3MzI5NTVCRUE3QTQwQUQ5M192aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dKRS13Qm93VTFZQV96Y0JBQzd6Z3Fob1ZZbEVicV9FQUFBRhUCAsgBACgAGAAbABUAACbMnOqG6ayDQBUCKAJDMywXQFRZmZmZmZoYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=b6fe64f03a&ccb=9-4&oh=00_AYGUO6emEzC9uICErngje0gofFLkNPzASQCHLCvp9WG-6A&oe=67D14591&_nc_sid=10d13b",
  "videoPlayCount": 39911,
  "videoViewCount": 11127,
  "hashtags": [
    "money",
    "wealth",
    "finance",
    "invest",
    "cars",
    "dogs"
  ],
  "slug": "spending-habits-that-would-upset-dave-ramsey",
  "title": "3 Spending Habits Most Likely to Upset Dave Ramsey",
  "subtitle": "Explore financial choices that might clash with traditional budgeting advice and the rationale behind these habits.",
  "content": "<h1>3 Spending Habits Most Likely to Upset Dave Ramsey</h1>\n<p>What are the three things you spend money on that would most likely piss off <strong>Dave Ramsey</strong>? I'll go first. I'm Tyler, a former financial advisor and portfolio manager, and now I create financial content for free to help you manage your finances better.</p>\n\n<h2>1. Brand New Cars</h2>\n<p>I buy <strong>brand new cars</strong>. And I lease them, Dave. I know that every time I lease a brand new car, I’m sacrificing about <strong>$100,000</strong> over the course of my investing career by not putting that money into low-cost index funds. But Dave, here’s the thing—a new car will give me something that a low-cost index fund won’t: <strong>new car smell</strong>. Priceless!</p>\n\n<h2>2. Dinner Delivery Services</h2>\n<p>I also spend on <strong>dinner delivery services</strong> because there is nothing I hate more than going to the grocery store. Why? Well, first, Dave, I’m a raging introvert. That’s why you’ll often find me walking alone in the woods without any friends. Second, when I go to the store, that’s at least <strong>one hour</strong> of my time that I will never get back. I pay about <strong>$90 a week</strong> not only to get four healthy and delicious meals shipped directly to my door but also to reclaim that lost time.</p>\n\n<h2>3. Toys for My Dogs</h2>\n<p>And this, Dave, well, you’re probably going to hate me for admitting this, but I spend about <strong>2%</strong> of every paycheck on the latest, greatest toys for my dogs. Don’t judge me, Dave. I’ve already judged myself for this one. I know that regardless of which monkey kong toy I buy, my dogs will either <strong>eat it within five minutes</strong> and then throw it back up, or <strong>ignore it completely</strong> and focus on the old Coke bottle that’s been lurking under the couch for the last month, just out of reach.</p>\n\n<p>If any of this is unhelpful, please like and follow, and I’ll keep trying to get you one step farther away from where you need to be.</p>",
  "tags": [
    "Spending Habits",
    "Financial Advice",
    "Dave Ramsey",
    "Budgeting",
    "Personal Finance"
  ]
}