{
  "id": "3444838478729775175",
  "url": "https://www.instagram.com/p/C_OhlhJSQhH/",
  "datePosted": "2024-08-28T20:27:03.000Z",
  "shortCode": "C_OhlhJSQhH",
  "timestamp": "2024-08-28T20:27:03.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fcgh10-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQP1CBaKwV8LmyXWkF74se8Fb_sn5AL7NPDUsxM6finc9RTouSDM10aPPMejrB8PnRW5H4OuDzGqWsf2j53b5__XNUdpu3xH9VaGh3U.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=101&vs=488553297295764_1062377928&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC8xMjRFNjFDM0FEMEFDQUY2Nzg0OEYyRTVGRTc5OURBRl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dKSVFReHRrR3hiVmVZSU1BRmMxZWFRN183b05icV9FQUFBRhUCAsgBACgAGAAbABUAACb044Ki0oLsPxUCKAJDMywXQE6AAAAAAAAYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=f297d4539d&ccb=9-4&oh=00_AYE4do-_v8wwyYFbh84sbS0ZubIJPqQW5ZA18sEYD6U0hA&oe=67D178DD&_nc_sid=10d13b",
  "videoPlayCount": 207714,
  "videoViewCount": 49482,
  "hashtags": [
    "investing",
    "recession",
    "reits",
    "wealth",
    "finance",
    "socialcap"
  ],
  "slug": "three-changes-to-make-investing-in-a-recession",
  "title": "Three Key Changes to Make in Investing During a Recession",
  "subtitle": "Discover essential strategies for investing during economic downturns including bonds, REITs, and cash management.",
  "content": "<h1>Three Key Changes to Make in Investing During a Recession</h1>\n<p>Hi, I'm Tyler, a former financial advisor and portfolio manager. Now, I focus on providing financial content for free to help you navigate your investment journey.</p>\n\n<h2>1. Transition from High Yield Savings Accounts to Long-Duration Bonds</h2>\n<p>If we enter a recession, the U.S. Federal Reserve will likely cut interest rates. As interest rates fall, it becomes more challenging to find dependable income investments. Therefore, I would recommend trading in your high yield savings accounts for longer duration bonds, such as those with 5 to 10-year maturities. The return on your high yield savings account will drop, whereas the returns on the 5 to 10 year bonds will remain stable over their duration.</p>\n\n<h2>2. Invest Heavily in REITs (Real Estate Investment Trusts)</h2>\n<p>Another aspect to focus on is increasing your investment in REITs. Real estate investment trusts must pay out at least 90% of their taxable income to shareholders. Similar to bonds, as interest rates decline, REITs tend to appreciate in value. Notable companies like <strong>Realty Income Group</strong> and <strong>Digital Realty Trust</strong> have already begun to see appreciation as smart money positions itself for future growth.</p>\n\n<h2>3. Maintain a Cash Reserve</h2>\n<p>Lastly, I would maintain 10 to 15% of my assets in cash or money markets. Keeping this cash reserve allows you to take advantage of market dips when index funds are on sale. Timing the market can be beneficial, and having liquidity can position you favorably for future investments.</p>\n\n<p>If any of this advice resonates with you, please like and follow for more insights to help you get one step closer to your financial goals!</p>",
  "tags": [
    "Investing Strategies",
    "Recession Planning",
    "Real Estate Investment Trusts",
    "Bonds Investment",
    "Cash Reserve Management"
  ]
}