{
  "id": "3446188910340402817",
  "url": "https://www.instagram.com/p/C_TUo4luu6B/",
  "datePosted": "2024-08-30T17:10:13.000Z",
  "shortCode": "C_TUo4luu6B",
  "timestamp": "2024-08-30T17:10:13.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fyvr4-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQOMicVPmhkEdC2FERmO2TW88Y4BVV5d9VujecCznutUSMxQhu8CrWvQFDCcxDSZRvhN1gx3KMcvJuIlH9S614RGK-SvNOZJpfYwIr4.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=106&vs=1940548889796948_1786578338&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC85NjRFNjg3QjQ2NkUzRDBDM0QzOEFGQjlGMjJGMTc4NF92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dFLXhTUnVKLU14Nmk2RURBTDJfR3FqZDBsVVVicV9FQUFBRhUCAsgBACgAGAAbABUAACb%2BiK3G%2FrP2QBUCKAJDMywXQFFEOVgQYk4YEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=5cbdf8be36&ccb=9-4&oh=00_AYHxlcAujIxOCC8KjA-PF17kAe_-HL3Ksk55BGJxhyCsEw&oe=67D15758&_nc_sid=10d13b",
  "videoPlayCount": 138050,
  "videoViewCount": 38765,
  "hashtags": [
    "money",
    "wealth",
    "investing",
    "financialadvisor",
    "socialcap"
  ],
  "slug": "three-investing-tips-you-need",
  "title": "Essential Investing Tips: The Three Keys to Building Wealth",
  "subtitle": "Discover essential investing tips that will last a lifetime. Learn how consistent contributions and timing in the market can help you build wealth effectively.",
  "content": "<h1>Three Investing Tips You Will Ever Need</h1>\n<p>Here are the only three investing tips that you will ever need. And you might want to save this video because this is as true today as it will be in 30 years.</p>\n<p>I'm Tyler. I'm a former financial advisor and portfolio manager. Now I make financial content for free so that you don't have to pay for it.</p>\n<h2>Tip 1: Don’t Quit Early</h2>\n<p>Most people never get rich from investing because they quit after a year or two. And I get it. You invest a thousand bucks this year in a low-cost index fund and the market has a solid year with a return of 7 or 8%. Cool. You just made about 19 cents a day. Yeah, I'd throw in the towel too.</p>\n<h2>Tip 2: Consistency is Key</h2>\n<p>Most people never get rich from investing because they’ll do a one-time investment of about a thousand bucks and then never invest again. Even with a consistent 7% return in the market, it will take you about a decade to double that initial investment. Whereas if you were to add just $9 a month to that initial investment, it would only take you five years to do the same.</p>\n<h2>Tip 3: Invest Independently of Market Trends</h2>\n<p>Most people never get rich from investing because they invest when the world is telling them it’s sexy to invest, aka when the market’s at an all-time high. And then they stop investing or worse, they sell when the world is telling them to run for the hills. That’s why I put a percentage of every single one of my paychecks into my Roth IRA or my Roth 401k.</p>\n<p>By doing this, I invest when the markets are up and I invest when the markets are down. And if any of this is helpful, like and follow, and I’ll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Investing Tips",
    "Wealth Building",
    "Financial Advice",
    "Long-Term Investment",
    "Market Timing"
  ]
}