{
  "id": "3398923089947970497",
  "url": "https://www.instagram.com/p/C8rZorDOMvB/",
  "datePosted": "2024-06-26T12:03:48.000Z",
  "shortCode": "C8rZorDOMvB",
  "timestamp": "2024-06-26T12:03:48.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-sjc3-1.cdninstagram.com/o1/v/t16/f2/m86/AQMiDJwEIJhBS7yUIW4XLUtLyN6OYVQdwr2v_D0XQPPjUj7awiPt2W18cbhuIneI2qOvEsjrYjRt-Y_4B8m0_DXILCMB_wqHaNOSSU8.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=108&vs=1696915311110842_4149979817&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9DNjQ3RTIxRERFMTU3OTNFNDZDMEE1QkVEQzA3OTg4RV92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dERVp4QnFOemlXUGpuVURBRkMwdGJPb25IdGdicV9FQUFBRhUCAsgBACgAGAAbABUAACbg69%2FklO%2BGQBUCKAJDMywXQGGwAAAAAAAYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=bd7d71b0cf&ccb=9-4&oh=00_AYGsammBdTTJ5VmhMRC8xzCTHsgCO1q1h8_oih_jQkGn3Q&oe=67D15E65&_nc_sid=10d13b",
  "videoPlayCount": 26727,
  "videoViewCount": 8192,
  "hashtags": [
    "finance",
    "ugma",
    "529",
    "custodialrothira",
    "socialcap",
    "invest"
  ],
  "slug": "three-essential-accounts-for-your-children",
  "title": "3 Essential Accounts to Set Up for Your Children",
  "subtitle": "Explore key financial accounts that can provide your children with a head start in wealth building and financial literacy.",
  "content": "<h1>3 Essential Accounts to Set Up for Your Children</h1>\n<p>Here are the only three accounts that I would consider opening for your children. One will give them a phenomenal head start in financial flexibility. One can make them a millionaire by retirement. And one can save you from being broke long before retirement. I'm Tyler, a former financial advisor and portfolio manager, and I create financial content for free to guide you in your financial decisions.</p>\n\n<h2>1. UGMA (Uniform Gifts to Minors Act)</h2>\n<p>The <strong>UGMA</strong> is an account that lets you transfer assets to your children without needing a formal trust, and it's available through any major brokerage. The first <strong>$1,250</strong> of unearned income is tax-free. The next <strong>$1,250</strong> is taxed at the child's rate, and anything beyond that is taxed at the parent's rate. There are no annual contribution limits, but the child gains full control of the assets between <strong>18 and 21</strong>, depending on your state. So if little Timmy isn't financially savvy or trustworthy, you might want to think twice about this one. Additionally, since UGMA assets are considered the child's assets, they will affect your financial aid eligibility more than if they were parental assets.</p>\n\n<h2>2. Custodial Roth IRA</h2>\n<p>The <strong>Custodial Roth IRA</strong> is funded with post-tax dollars and is excellent for teaching your children about long-term investing. Contributions are limited to the lesser of your child's earnings or the annual limit. Yes, your child can earn money through jobs like babysitting or helping with family business tasks. However, you cannot just put assets into the account unless it's from legitimate earned income. The primary advantage of this account is that even a one-time contribution of <strong>$7,000</strong> at a young age could easily set your child up to be a millionaire by retirement if invested appropriately. However, keep in mind this account is also considered a child's asset for financial aid eligibility.</p>\n\n<h2>3. 529 College Savings Plan</h2>\n<p>If little Timmy or Sally is college-bound, the <strong>529 College Savings Plan</strong> is your new best friend. This account is funded with post-tax dollars like a Roth IRA. However, unlike a Roth, you can contribute over <strong>$500,000</strong> to most of these accounts, depending on your state’s plan. The 529 offers tax-free growth and withdrawals on qualified educational expenses. Additionally, you retain full control of this account and can change the beneficiary if needed. It’s the only one of these three accounts treated as a parental asset and not a child's asset when considered for financial aid. Even better, now up to <strong>$35,000</strong> of unused funds can be rolled over to a child's Roth IRA, offering them similar benefits.</p>\n\n<p>If any of this is helpful, please like and follow, and I'll keep sharing insights to help you and your children get one step closer to where you need to be.</p>",
  "tags": [
    "Children's Finance",
    "UGMA",
    "Roth IRA",
    "529 Plan",
    "Financial Planning"
  ]
}