{
  "id": "3781731854555427788",
  "url": "https://www.instagram.com/p/DR7aRXSjjPM/",
  "datePosted": "2025-12-06T16:13:44.000Z",
  "shortCode": "DR7aRXSjjPM",
  "timestamp": "2025-12-06T16:13:44.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-atl3-3.cdninstagram.com/o1/v/t16/f2/m86/AQNa1unoG5c0miflBwjgrJRgbwmvDN_fG2BUAw0PXMPghN3FRhDVvpgSjhVSXZKEMTP0XIsIolKeGglHM_hICu5N3edDHdq4SHu-X8k.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=109&vs=847428191369981_3496994608&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9CMjQ0NzFENDA3MUFFRDhDNkYyNkE1RUEwNjcxRUJCN192aWRlb19kYXNoaW5pdC5tcDQVAALIARIAFQIYOnBhc3N0aHJvdWdoX2V2ZXJzdG9yZS9HR1N2ZVNPWHk5ZHFDVFVFQUpkbFY2cnU0SkFsYnN0VEFRQUYVAgLIARIAKAAYABsAFQAAJublp%2B3278I%2FFQIoAkMzLBdAWVVP3ztkWhgSZGFzaF9iYXNlbGluZV8xX3YxEQB1%2Fgdl5p0BAA%3D%3D&_nc_rid=42251252b1&ccb=9-4&oh=00_Afniek8nE3iorEotHyJnpfyhr6fkUkf0OSIOS5F4pAXwCg&oe=6936C500&_nc_sid=10d13b",
  "videoPlayCount": 93063,
  "videoViewCount": 35986,
  "hashtags": [
    "money",
    "wealth",
    "finance",
    "tylet"
  ],
  "slug": "top-five-index-funds-to-hold-forever",
  "title": "Top Five Index Funds to Buy and Hold Forever",
  "subtitle": "Invest in these funds for a reliable long-term portfolio.",
  "content": "<h1>Top Five Index Funds to Buy and Hold Forever</h1>\n<p>I'm Tyler, a former financial advisor and portfolio manager. Now I make financial content for free so you don't have to pay for it.</p>\n\n<h2>1. ITOT</h2>\n<p>This is your total U.S. stock market fund from iShares. It owns everything from Apple and Amazon to the small industrial company that makes bolts for Apple and Amazon. It's your financial car heart jacket. Timeless, sturdy, and never goes out of style, at least in Vermont.</p>\n\n<h2>2. QQQJ</h2>\n<p>This tracks the next-gen NASDAQ 100, meaning slightly smaller, faster-growing tech and innovation names. Think of it as QQQ's younger, caffeinated cousin who just discovered AI and lives mostly off of Celsius.</p>\n\n<h2>3. DGRO</h2>\n<p>This is iShares' dividend growth ETF. These companies quietly raise their dividends every year like clockwork. And it's your financial Subaru Outback. Boring, reliable, and somehow still running after 300,000 miles and 14 mud seasons in Vermont.</p>\n\n<h2>4. iXUS</h2>\n<p>A global XUS fund. You'll own developed and emerging markets from Europe to Asia because some years America wins, and other years it's Japan, India, or some random bank in Scandinavia that crushes it and nobody knows about it. Either way, you now own it all and never have to feel left out again.</p>\n\n<h2>5. BIL</h2>\n<p>This is a short-term treasury ETF paying about 4% to 5% right now. It's where I might park cash for stability and peace of mind so I can focus on more important things like convincing my bloodhounds that wearing matching flannel for Christmas is not optional.</p>\n\n<p>And that's it. Five funds, 10 minutes, zero need to pay a financial advisor 1% of your assets to click the same buttons for you. If any of this is helpful, sign up for my free weekly newsletter by clicking the link in my bio. Each week, I'll send you over another money playbook that actually works.</p>",
  "tags": [
    "Index Funds",
    "Investing",
    "Portfolio Management",
    "Personal Finance",
    "ETFs"
  ]
}