{
  "id": "3467092345663005079",
  "url": "https://www.instagram.com/p/DAdlh5yuCGX/",
  "datePosted": "2024-09-28T13:22:08.000Z",
  "shortCode": "DAdlh5yuCGX",
  "timestamp": "2024-09-28T13:22:08.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fmnl9-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQPukyjhxaHqBkW4KkxazfXn_w6yXuWxUE1mBy8_1bN7dVCQh1ieDgHHetyI3WaCPZgXbf8d_KM24zfztuueBBu07LRDGjG9M0kmC6E.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=110&vs=1327922265283989_727420590&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC8yODQ3RjU0NzVBQkU3NTdCNjQxMUM3NDZERUNCQkVBNl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dOYXVnQnM3LUJiUEllSUJBSVQ3Nm9ESGJQd1picV9FQUFBRhUCAsgBACgAGAAbABUAACamtvy0nbqCQBUCKAJDMywXQFTMzMzMzM0YEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=98beef482f&ccb=9-4&oh=00_AYEkjLXP885D86oj2OsnhSvBbxYAzgkM9dQxkuirJ1chPg&oe=67D16B9A&_nc_sid=10d13b",
  "videoPlayCount": 78178,
  "videoViewCount": 33508,
  "hashtags": [
    "financialplanner",
    "finance",
    "financialplanning.",
    "FacetAd",
    "wealth",
    "money",
    "investing"
  ],
  "slug": "top-three-things-to-consider-when-choosing-a-financial-planner",
  "title": "Top Three Essential Factors to Consider When Choosing a Financial Planner",
  "subtitle": "Discover the key elements to evaluate in a financial planner, ensuring you receive personalized attention, goal-focused strategies, and unbiased advice.",
  "content": "<h2>As a former financial advisor, here are the top three things I would look for if I were choosing a financial planner.</h2>\n<p>I'm Tyler, a former financial advisor and portfolio manager. Now, I create financial content with companies like Facet to demonstrate exactly what financial planning should look like.</p>\n\n<h3>1. Are They Going to Pick Up My Calls?</h3>\n<p>With most firms, if you’re not an A-list client—meaning you don’t have a billion dollars, from which they derive a percentage in annual fees—you are not a priority to that planner. At Facet, you have <strong>unlimited messaging</strong> with the Facet team, whether you have 50 bucks or 50 million bucks.</p>\n\n<h3>2. Are They Going to Keep Me Focused on My Goals?</h3>\n<p>At most firms, the planner will invest your money across a few funds within about 15 minutes to set it and forget it, allowing them to focus their entire efforts on bringing in new clients with more money. In contrast, at Facet, they will <strong>check in with you monthly</strong> to ensure you are staying on track.</p>\n\n<h3>3. Are They Actually Offering Me Unbiased Advice?</h3>\n<p>I prefer working with planners who do not receive commissions for selling me products. At Facet, your team of certified financial planner professionals and specialists provide <strong>expert investing advice</strong>, personalized insurance coverage recommendations, and guidance in estate planning and tax strategy—all with <strong>zero commission attached</strong>.</p>\n\n<p>That is why I partner with Facet. They practice exactly what I preach. So go to <a href=\"https://facet.com/tyler\">facet.com/tyler</a> today. New annual members will get the $250 enrollment fee waived, bringing you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Planning",
    "Choosing a Financial Planner",
    "Investment Advice",
    "Unbiased Financial Advice",
    "Facet"
  ]
}