{
  "id": "3392405734229182066",
  "url": "https://www.instagram.com/p/C8UPwqiuoZy/",
  "datePosted": "2024-06-17T12:15:04.000Z",
  "shortCode": "C8UPwqiuoZy",
  "timestamp": "2024-06-17T12:15:04.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fcnq4-1.fna.fbcdn.net/o1/v/t16/f2/m82/AQMpr6oOYv3dTRMUpnnYHynqwu2LVk83jxFJiHrxSBaUXQIrVsYhQvi6LPI7Ug04zPpMmqKGJkXfb6FL8mStNH431PgZGG_M74kowdE.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=105&vs=1432577794063107_3409920613&_nc_vs=HBksFQIYT2lnX3hwdl9yZWVsc19wZXJtYW5lbnRfcHJvZC85NDQyOUUzRkMwNUFDODk3MzgyNUM1RkI1OUZDMzNCOV92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dMd012UnJldUpUMzM4Z0NBTWdSNGt4YzlGQWZicV9FQUFBRhUCAsgBACgAGAAbABUAACaOscTGvMmIQBUCKAJDMywXQF8MzMzMzM0YEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=e0cf148504&ccb=9-4&oh=00_AYG9_mKLKEa7_LQgtX7vnNX7qSfADxQ4kXalQ4kVy3MQMA&oe=67D1674F&_nc_sid=10d13b",
  "videoPlayCount": 20397,
  "videoViewCount": 3661,
  "hashtags": [
    "fee",
    "financialadvisors",
    "invest",
    "money",
    "wealth",
    "retirement",
    "socialcap"
  ],
  "slug": "understanding-financial-advisor-fee-structures",
  "title": "Understanding Financial Advisor Fee Structures: 5 Key Insights to Save You Money",
  "subtitle": "Discover the critical aspects of financial advisor fee structures to avoid losing thousands over your lifetime. Learn the fees to watch for and how to negotiate effectively.",
  "content": "<h1>Five Things to Know About Financial Advisor Fee Structures</h1>\n<p>If you are thinking about working with a financial advisor, here are the five things you need to know about fee structures so you don't lose hundreds of thousands of dollars over the course of a lifetime.</p>\n<p><strong>I'm Tyler,</strong> I'm a former financial advisor and portfolio manager, and now I make financial content for free so you don't have to pay for it.</p>\n\n<h2>1. Understand the Three Primary Types of Fee Structures</h2>\n<p>There are three primary types of fee structures:</p>\n<ol>\n    <li>Percentage of assets under management</li>\n    <li>Flat annual fee</li>\n    <li>Commissions-based fees</li>\n</ol>\n<p>You are looking for a flat annual fee. Paying a percentage of your assets under management is borderline criminal, and working with someone who is paid from commissions presents an inherent conflict of interest. <strong>How could you possibly trust someone to act in your best interest if the products that they're recommending are geared towards their best interest?</strong></p>\n\n<h2>2. Negotiability of Fee Structures</h2>\n<p>All fee structures are negotiable. Even if you have been with the same advisor for 30 years or your parents were clients of that advisor, come up with what you're willing to pay for the services provided. Don’t hesitate to communicate that you would be happy to take your business elsewhere if they cannot meet you at that price. <strong>There are plenty of people who will take your money.</strong></p>\n\n<h2>3. Fee Structures vs. Your Goals</h2>\n<p>Some fee structures will not necessarily align with your goals. If you're paying a percentage of assets under management, keep in mind that it's in the advisor's best interest for your account to grow in size. They might adopt a growth strategy bias while what you truly need is a protective and fixed income strategy.</p>\n\n<h2>4. Beware of Breakpoint Fees</h2>\n<p>Do not be fooled by the attractive deals you think you’ll receive with breakpoint fees. For instance, in fee structures that charge you a percentage of assets under management, the more you give the advisor to manage, the lower the marginal percentage fee. This may lead you to pay 1% in fees on the first million you invest and 0.75% on the next million. <strong>It sounds appealing that the percentage of fees decreases, but you just agreed to pay your advisor another $7,500 annually for the rest of your life.</strong> Always think about dollars, not percentages.</p>\n\n<h2>5. Transparency of Fees</h2>\n<p>Make sure the fees you see are the fees you pay. A common scenario is when an advisor puts you in a fund of funds. You may find yourself paying 1% to the advisor, 1% for being in that mutual fund, and 1% for each mutual fund that the mutual fund invests in.<br/> Fund of funds? Not so fun!</p>\n<p>If any of this is helpful, please like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advisors",
    "Fee Structures",
    "Investing Tips",
    "Negotiating Fees",
    "Personal Finance"
  ]
}