{
  "id": "3450644862405779589",
  "url": "https://www.instagram.com/p/C_jJzhVuSCF/",
  "datePosted": "2024-09-05T20:43:57.000Z",
  "shortCode": "C_jJzhVuSCF",
  "timestamp": "2024-09-05T20:43:57.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fjoi8-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQOmvUkLt0f6tE2j8oO3fqQkl0x18UVzG9zOfHoVu0hVXo-xkb4arAsurJnHqyZtrfpKTO4hmhNu288MzqMoeT13KpGW47EzcuQS1cY.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=106&vs=526337396635708_1899085909&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC8wNTQ1REExMDg3MzA2M0M3ODU1MDZEQjU3RUUzQTJCQl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dJQWpWQnVfMklIRnRLY0JBTUZlRS1jd2NHaFFicV9FQUFBRhUCAsgBACgAGAAbABUAACbk3cmVq5eRQBUCKAJDMywXQFgogxJul40YEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=9897ec9986&ccb=9-4&oh=00_AYGOm7X0LYdjRzhgHm7bqhlkVycO1_sZx_8jGEZMb6Skig&oe=67D16B81&_nc_sid=10d13b",
  "videoPlayCount": 113028,
  "videoViewCount": 36466,
  "hashtags": [
    "financialadvisor",
    "cfp",
    "cfa",
    "series7",
    "invest",
    "insuranceagent",
    "money",
    "socialcap"
  ],
  "slug": "understanding-financial-advisor-qualifications",
  "title": "Understanding Financial Advisor Qualifications: What You Need to Know",
  "subtitle": "Explore key qualifications to look for in a financial advisor, including necessary certifications such as CFP and CFA, and what they mean for your financial future.",
  "content": "<h1>Understanding Financial Advisor Qualifications</h1>\n<p>If you are thinking about working with a financial advisor, here's everything you need to know about their potential qualifications in under one minute.</p>\n<p>I'm Tyler, I'm a former financial advisor and portfolio manager, and now I make financial content for free so that you don't have to pay for it.</p>\n\n<h2>1. Key Certifications</h2>\n<p>If they hold a <strong>Series 7, 63, or 65</strong>, they have passed a basic four-hour exam that primarily tests their knowledge of laws and regulations. There is a reason that in every old Wall Street movie, once someone gets their Series 7, they're told to do nothing more than pick up the phone and start calling you to ask for your money.</p>\n\n<h2>2. Certified Financial Planner (CFP)</h2>\n<p>If the advisor is a <strong>CFP</strong>, or Certified Financial Planner, they've passed some legit exams covering estate planning, insurance, taxes, investment strategies, and ethics. Note, those without CFPs tend to refer to this illustrious crowd as those who can't effing produce. Ironically, you can rest assured that if someone holds a CFP, they're usually in it for the right reasons.</p>\n\n<h2>3. Chartered Financial Analyst (CFA)</h2>\n<p>If the advisor holds their <strong>CFA</strong>, they are a Chartered Financial Analyst and have spent more time studying than you probably did throughout your entire college career. I'm not kidding. Their CFA requires about 900 hours of reading across various topics. They have to pass three of the hardest exams in finance. If they have their CFA, they know what they're talking about.</p>\n\n<h2>4. Insurance Agents</h2>\n<p>If the advisor is an insurance agent who holds only a property and casualty license or health and life license, note they are not qualified or certified to talk to you about investing strategy, no matter how much they wanna be.</p>\n\n<h2>5. Fiduciary Duty</h2>\n<p>Finally, if the advisor adheres to <strong>regulation BI</strong>, best interest, or they serve in a fiduciary capacity, they're supposed to put your interest above their own. That said, Bernie Madoff was a fiduciary. I'm just saying, people are people.</p>\n\n<p>If any of this is helpful, like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advisor",
    "CFP Certification",
    "CFA Certification",
    "Investment Strategies",
    "Fiduciary Responsibility"
  ]
}