{
  "id": "3402063137677661877",
  "url": "https://www.instagram.com/p/C82jmYYula1/",
  "datePosted": "2024-06-30T20:03:29.000Z",
  "shortCode": "C82jmYYula1",
  "timestamp": "2024-06-30T20:03:29.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://instagram.fcaw3-1.fna.fbcdn.net/o1/v/t16/f2/m86/AQMQWXua_N5Cu6OBy2iRlnFxdD3aAAYPL4P-7tTBoVHaXRvkpsLRGhXgPmuqhxAsfrqCtxB2RcreOQyY1Fb6DO9uKcNPEjfKlFUwLBg.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuNzIwLmJhc2VsaW5lIn0&_nc_cat=102&vs=797261185809150_3051959216&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9DNTQ1OEYxNDFCRTYzQjBBMDc4RkQ3OEZDMDQ4MEJBQl92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dMREt6QnI4NURSQms1UUJBRmIyS2hoTTBuZDBicV9FQUFBRhUCAsgBACgAGAAbABUAACbG%2Bqbw5ObDPxUCKAJDMywXQFZAAAAAAAAYEmRhc2hfYmFzZWxpbmVfMV92MREAdf4HAA%3D%3D&_nc_rid=d817eebc5d&ccb=9-4&oh=00_AYFFYMziIp8MMye9YGxwQbPJFrj8sj9xiaqWoDmHPVlZ-Q&oe=67D14F95&_nc_sid=10d13b",
  "videoPlayCount": 198970,
  "videoViewCount": 13243,
  "hashtags": [
    "banks",
    "money",
    "mortgage",
    "hysa",
    "hyca",
    "moneymarket",
    "invest",
    "socialcap"
  ],
  "slug": "why-i-wont-pay-my-mortgage-early",
  "title": "The Top Reason I Refuse to Pay Off My Mortgage Early: A Financial Perspective",
  "subtitle": "Discover why paying down your mortgage early may not be the best financial decision in a rising interest rate environment, and explore alternative investment opportunities.",
  "content": "<h1>The Top Reason I Refuse to Pay Off My Mortgage Early</h1>\n<p>Here is the number one reason that I will not even put one dime towards paying down my mortgage early.</p>\n<p>I'm Tyler, a former financial advisor and portfolio manager, and now I create financial content for free so that you don't have to pay for it.</p>\n<p>Recently, I had lunch with my mortgage officer, seeking inspiration for content. I asked her if she thought it was a good financial decision for people to pay off their mortgages early right now. She laughed.</p>\n<p>I asked, “So is it?”</p>\n<p>She replied, “Tyler, for us, the bank, it's a great idea. We would love to get that money back and get all of those low-interest rate loans off of our books.”</p>\n<p>Now, I don't know much, but I do know this: When a bank lender tells you they want their money back, you don’t give it to them. It means there’s a much better opportunity out there.</p>\n<p>I know what you’re thinking: “But Tyler, that mortgage payment is a guaranteed return.”</p>\n<p>Keep in mind, I was having lunch with a representative of a regional bank. She wouldn’t want the money back unless she knew there was a guaranteed better opportunity. And in a rising interest rate environment, there is.</p>\n<p>Currently, high-yield checking accounts are returning 6%, high-yield savings accounts are returning 5.5%, CDs are returning 5%, and money markets are at 5%. Additionally, investing directly in short-term treasuries can yield similar returns.</p>\n<p>So yes, I could save an additional $80,000 by paying an additional 20% on my mortgage. Or I could earn about double that by investing in short-term and stable securities backed by the full faith and credit of the United States government.</p>\n<p>Yeah, I'll take that bet. If any of this is helpful, please like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Finance Tips",
    "Mortgage Advice",
    "Investment Strategies",
    "Interest Rates",
    "Financial Independence"
  ]
}