{
  "id": "3420181014045724715",
  "url": "https://www.instagram.com/p/C927ILpuxAr/",
  "datePosted": "2024-07-25T19:59:39.000Z",
  "shortCode": "C927ILpuxAr",
  "timestamp": "2024-07-25T19:59:39.000Z",
  "ownerFullName": "Tyler Gardner",
  "ownerUserName": null,
  "videoUrl": "https://scontent-iad3-2.cdninstagram.com/o1/v/t16/f2/m86/AQOsq1rL8sNOGQqgvefpnafyNW_cTgKcfbNOhAvEJ_3v071vaDMwhZSfk4CXJUjoCNWdl6yfQ1DPlIr1COMxEKDXA6pO2l_yhMwmivo.mp4?stp=dst-mp4&efg=eyJxZV9ncm91cHMiOiJbXCJpZ193ZWJfZGVsaXZlcnlfdnRzX290ZlwiXSIsInZlbmNvZGVfdGFnIjoidnRzX3ZvZF91cmxnZW4uY2xpcHMuYzIuMzYwLmJhc2VsaW5lIn0&_nc_cat=109&vs=1868379976972145_4135277798&_nc_vs=HBksFQIYUmlnX3hwdl9yZWVsc19wZXJtYW5lbnRfc3JfcHJvZC9CNTRERkY4NTU4RDczRDg4NEU5ODJCNzg2NjEzNjM5Ql92aWRlb19kYXNoaW5pdC5tcDQVAALIAQAVAhg6cGFzc3Rocm91Z2hfZXZlcnN0b3JlL0dPZmctQnBxYThVNnJnWURBSng5Nmh0a2xqaFlicV9FQUFBRhUCAsgBACgAGAAbABUAACb0yPTzjumDQBUCKAJDMywXQFeu6XjU%2FfQYEmRhc2hfYmFzZWxpbmVfM192MREAdf4HAA%3D%3D&_nc_rid=15973347f7&ccb=9-4&oh=00_AYG--T-ASt5q7hxD-BPva2XV0mqIIY2aATxXJ1EgEmY6Lw&oe=67D16A04&_nc_sid=10d13b",
  "videoPlayCount": 61099,
  "videoViewCount": 24130,
  "hashtags": [
    "financialadvisor",
    "investing",
    "invest",
    "wealth",
    "socialcap"
  ],
  "slug": "working-with-financial-advisors",
  "title": "5 Essential Tips for Choosing a Financial Advisor Wisely",
  "subtitle": "Discover key considerations for selecting a financial advisor that aligns with your needs and maximizes your investment success in this insightful guide.",
  "content": "<h1>5 Essential Tips for Choosing a Financial Advisor Wisely</h1>\n<p>If you are thinking about working with a financial advisor, here are five things you should probably think about.</p>\n<p>I'm Tyler, a former financial advisor and portfolio manager, and now I make financial content for free so that you don't have to pay for it.</p>\n\n<h2>1. Fee Structure</h2>\n<p>Avoid advisors charging a percentage of assets under management. Instead, look for those charging a flat annual fee for their services. You will save a considerable amount of money over your lifetime. Paying a 1% fee on a $1 million portfolio could cost you over $100,000 over the next 10 years.</p>\n\n<h2>2. Past Performance</h2>\n<p>I would demand to see aggregate client performance after all fees have been taken out of the picture. Advisors aren't actually required to show this to you. If they choose not to, that’s your red flag.</p>\n\n<h2>3. Investment Approach</h2>\n<p>I would interview multiple advisors and ask them about their investment strategies. If they recommend low-cost index funds, you could do that on your own. If they suggest mutual funds, that's about double the cost, and you could manage that yourself. Note that 90% of active advisors do not outperform the overall market. Additionally, they don't know which stocks or bonds will go up or down any more than you do.</p>\n\n<h2>4. Credentials</h2>\n<p>Prioritize advisors with recognized credentials such as CFA, CPA, CFP, or MBA. These indicators reflect a basic competency beyond mere licensing. While series 7, 65, and 66 licenses are necessary, they primarily test legal knowledge, not financial acumen.</p>\n\n<h2>5. Experience</h2>\n<p>Seek advisors who have experience navigating economic cycles. Investing through recession showcases their ability to mitigate risk and safeguard client assets effectively.</p>\n\n<p>If any of this is helpful, like and follow, and I'll keep trying to get you one step closer to where you need to be.</p>",
  "tags": [
    "Financial Advisors",
    "Investment Strategy",
    "Fee Structure",
    "Financial Credentials",
    "Client Performance"
  ]
}